# Premiere  notebook

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("http://cazabetremy.fr/Teaching/bitcoinClass/2021/trx_last_1M.csv")

In [4]:
data.columns = ["cl_in","cl_out","timestamp","value","valueDoll"]
data

              cl_in     cl_out   timestamp     value    valueDoll
0          21231183       2633  1473221594  0.005014     3.082268
1          21231183   21231183  1473221594  0.040328    24.793546
2           4847880   53797835  1473221594  0.019596    12.047425
3           4847880  121760693  1473221594  0.118399    72.790337
4         139771794  BTC-e.com  1473221594  0.002444     1.502412
...             ...        ...         ...       ...          ...
999994     79797142  123356081  1473368159  0.837321   523.283734
999995  scammer8135   96880646  1473368159  0.022898    14.310018
999996  scammer8135   93725777  1473368159  0.000041     0.025910
999997     53071260   55730177  1473368159  0.107372    67.102000
999998     53071260   53071260  1473368159  6.708407  4192.418961

[999999 rows x 5 columns]

In [5]:
data.head()

       cl_in     cl_out   timestamp     value  valueDoll
0   21231183       2633  1473221594  0.005014   3.082268
1   21231183   21231183  1473221594  0.040328  24.793546
2    4847880   53797835  1473221594  0.019596  12.047425
3    4847880  121760693  1473221594  0.118399  72.790337
4  139771794  BTC-e.com  1473221594  0.002444   1.502412

In [18]:
pip install FLightRadarAPI;  # <-- besoin de mettre en commentaire une fois charchee

In [7]:
from FlightRadar24.api import FlightRadar24API

In [8]:
fr_api = FlightRadar24API()

In [9]:
airlines = fr_api.get_airlines()

In [10]:
# donner un type 
type(airlines)

list

In [11]:
# transforme list en dataframe 
airlines_data = pd.DataFrame(airlines)

In [12]:
airlines_data.head()

               Name Code ICAO
0            21 Air   2I  CSB
1   25Only Aviation       ONY
2   2Excel Aviation       BRO
3       40-Mile Air   Q5  MLA
4  748 Air Services   FE  IHO

In [13]:
airlines_data["Name"]

0                       21 Air
1              25Only Aviation
2              2Excel Aviation
3                  40-Mile Air
4             748 Air Services
                 ...
1602                   Zetavia
1603            Zimex Aviation
1604    Zimex Aviation Austria
1605                    ZIPAIR
1606                     Zorex
Name: Name, Length: 1607, dtype: object

In [14]:
airlines_data["Name"] == "21 Air"

0        True
1       False
2       False
3       False
4       False
        ...
1602    False
1603    False
1604    False
1605    False
1606    False
Name: Name, Length: 1607, dtype: bool

In [15]:
#filtrer (version longue)
airlines_filtre = airlines_data["Name"] == "21 Air"
# filter rows for year 2002 using  the boolean variable
air = airlines_data[airlines_filtre]
print(air.shape)

air.head()

(1, 3)

     Name Code ICAO
0  21 Air   2I  CSB

In [16]:
# filtrer (version courte)
airlines_data[airlines_data["Name"] == "Air France"]

           Name Code ICAO
102  Air France   AF  AFR